In [1]:
import os
import pandas as pd

df1= pd.read_csv('Events_US.csv', skiprows=1)

In [2]:
df1.head()

,Name,Disaster,Begin Date,End Date,Total CPI-Adjusted Cost (Millions of Dollars),Deaths
0,Southern Severe Storms and Flooding (April 1980),Flooding,19800410,19800417,2678.6,7
1,Hurricane Allen (August 1980),Tropical Cyclone,19800807,19800811,2177.2,13
2,Central/Eastern Drought/Heat Wave (Summer-Fall...,Drought,19800601,19801130,39579.0,1260
3,Florida Freeze (January 1981),Freeze,19810112,19810114,2019.2,0
4,"Severe Storms, Flash Floods, Hail, Tornadoes (...",Severe Storm,19810505,19810510,1372.9,20

In [3]:
df2= pd.read_csv('state_cost_data.csv', skiprows=1)

In [4]:
df2.head()

,state,drought,flooding,freeze,severe storm,tropical cyclone,wildfire,winter storm
0,AK,0.0,0.0,0.0,0.0,0.0,2292.8,0.0
1,AL,6780.6,134.7,148.7,13894.8,26457.6,716.4,2377.1
2,AR,6651.0,4597.8,291.0,10216.5,706.4,0.0,1135.5
3,AZ,1486.5,1879.5,0.0,5358.0,0.0,1327.8,0.0
4,CA,16199.3,18798.3,15131.0,3445.4,0.0,98106.3,0.0

In [5]:
df3= pd.read_csv('state_freq_data.csv', skiprows=1)

In [6]:
df3.head()

,year,state,drought,flooding,freeze,severe storm,tropical cyclone,wildfire,winter storm
0,1980,AK,0,0,0,0,0,0,0
1,1980,AL,1,0,0,0,0,0,0
2,1980,AR,1,1,0,0,0,0,0
3,1980,AZ,0,0,0,0,0,0,0
4,1980,CA,0,0,0,0,0,0,0

In [7]:
df3['state'].head()

0    AK
1    AL
2    AR
3    AZ
4    CA
Name: state, dtype: object

In [8]:
state_by_flooding = df3.loc[:,['state','flooding']]

In [9]:
cost_per_flood = df2.loc[:,['state','flooding']]

In [10]:
df4= df3.groupby(by= 'state',as_index= False)['flooding'].sum()

In [11]:
df4.head()

  state  flooding
0    AK         0
1    AL         2
2    AR         9
3    AZ         3
4    CA         6

In [12]:
df4.columns

Index(['state', 'flooding'], dtype='object')

In [13]:
df4['flooding']

0      0
1      2
2      9
3      3
4      6
5      2
6      3
7      0
8      2
9      4
10     4
11     0
12     0
13     7
14     3
15     7
16     6
17     6
18     4
19    10
20     4
21     5
22     2
23     4
24     5
25     9
26     5
27     4
28     2
29     4
30     5
31     2
32     4
33     0
34     1
35     5
36     5
37     6
38     3
39     5
40     0
41     2
42     3
43     4
44     4
45     9
46     1
47     5
48     0
49     1
50     3
51     4
52     2
53     0
Name: flooding, dtype: int64

In [14]:
df4['state']

0     AK
1     AL
2     AR
3     AZ
4     CA
5     CO
6     CT
7     DC
8     DE
9     FL
10    GA
11    GU
12    HI
13    IA
14    ID
15    IL
16    IN
17    KS
18    KY
19    LA
20    MA
21    MD
22    ME
23    MI
24    MN
25    MO
26    MS
27    MT
28    NC
29    ND
30    NE
31    NH
32    NJ
33    NM
34    NV
35    NY
36    OH
37    OK
38    OR
39    PA
40    PR
41    RI
42    SC
43    SD
44    TN
45    TX
46    UT
47    VA
48    VI
49    VT
50    WA
51    WI
52    WV
53    WY
Name: state, dtype: object

In [15]:
flooding_cost_per_state= pd.merge(df4, cost_per_flood, left_on = 'state', right_on='state')

In [16]:
flooding_cost_per_state.head()

  state  flooding_x  flooding_y
0    AK           0         0.0
1    AL           2       134.7
2    AR           9      4597.8
3    AZ           3      1879.5
4    CA           6     18798.3

In [17]:
flooding_cost_per_state.rename(columns={'flooding_x': 'Total number of Floods', 'flooding_y': 'State Flooding Cost(Millions)'}, inplace= True)

In [18]:
flooding_cost_per_state.head()

  state  Total number of Floods  State Flooding Cost(Millions)
0    AK                       0                            0.0
1    AL                       2                          134.7
2    AR                       9                         4597.8
3    AZ                       3                         1879.5
4    CA                       6                        18798.3

In [19]:
flooding_cost_per_state.index = flooding_cost_per_state.index + 1

In [20]:
flooding_cost_per_state.head()

  state  Total number of Floods  State Flooding Cost(Millions)
1    AK                       0                            0.0
2    AL                       2                          134.7
3    AR                       9                         4597.8
4    AZ                       3                         1879.5
5    CA                       6                        18798.3

In [21]:
df_drought= df3.groupby(by= 'state',as_index= False)['drought'].sum()

In [22]:
state_by_drought = df3.loc[:,['state','drought']]

In [23]:
cost_per_drought = df2.loc[:,['state','drought']]

In [24]:
drought_cost_per_state= pd.merge(df_drought, cost_per_drought, left_on = 'state', right_on='state')
drought_cost_per_state.index = drought_cost_per_state.index + 1

In [25]:
drought_cost_per_state.head()

  state  drought_x  drought_y
1    AK          0        0.0
2    AL         16     6780.6
3    AR         16     6651.0
4    AZ         15     1486.5
5    CA         14    16199.3

In [26]:
drought_cost_per_state.rename(columns={'drought_x': 'Total number of Droughts', 'drought_y': 'State Droughts Cost(Millions)'}, inplace= True)
drought_cost_per_state.index = drought_cost_per_state.index + 1

In [27]:
drought_cost_per_state.head()

  state  Total number of Droughts  State Droughts Cost(Millions)
2    AK                         0                            0.0
3    AL                        16                         6780.6
4    AR                        16                         6651.0
5    AZ                        15                         1486.5
6    CA                        14                        16199.3

In [28]:
df_freeze= df3.groupby(by= 'state',as_index= False)['freeze'].sum()

In [29]:
cost_per_freeze = df2.loc[:,['state','freeze']]

In [30]:
freeze_cost_per_state= pd.merge(df_freeze, cost_per_freeze, left_on = 'state', right_on='state')

In [31]:
freeze_cost_per_state.rename(columns={'freeze_x': 'Total number of Droughts', 'freeze_y': 'State Freeze Cost(Millions)'}, inplace= True)
freeze_cost_per_state.index = freeze_cost_per_state.index + 1


freeze_cost_per_state.head()

  state  Total number of Droughts  State Freeze Cost(Millions)
1    AK                         0                          0.0
2    AL                         3                        148.7
3    AR                         2                        291.0
4    AZ                         0                          0.0
5    CA                         3                      15131.0

In [32]:
df_severe_storm= df3.groupby(by= 'state',as_index= False)['severe storm'].sum()

In [33]:
cost_per_severe_storm = df2.loc[:,['state','severe storm']]

In [34]:
severe_storm_cost_per_state= pd.merge(df_severe_storm, cost_per_severe_storm, left_on = 'state', right_on='state')

In [35]:
severe_storm_cost_per_state.rename(columns={'severe storm_x': 'Total number of Severe Stormes', 'severe storm_y': 'State Severe Storm Cost(Millions)'}, inplace= True)
severe_storm_cost_per_state.index = severe_storm_cost_per_state.index + 1



severe_storm_cost_per_state.head()

  state  Total number of Severe Stormes  State Severe Storm Cost(Millions)
1    AK                               0                                0.0
2    AL                              54                            13894.8
3    AR                              51                            10216.5
4    AZ                               1                             5358.0
5    CA                               4                             3445.4

In [36]:
df_tropical_cyclone= df3.groupby(by= 'state',as_index= False)['tropical cyclone'].sum()

In [37]:
cost_per_tropical_cyclone = df2.loc[:,['state','tropical cyclone']]

In [38]:
tropical_cyclone_cost_per_state= pd.merge(df_tropical_cyclone, cost_per_tropical_cyclone, left_on = 'state', right_on='state')

In [39]:
tropical_cyclone_cost_per_state.rename(columns={'tropical cyclone_x': 'Total number of Tropical cyclones', 'tropical cyclone_y': 'State Tropical cyclone Cost(Millions)'}, inplace= True)
tropical_cyclone_cost_per_state.index = tropical_cyclone_cost_per_state.index + 1

tropical_cyclone_cost_per_state.head()

,state,Total number of Tropical cyclones,State Tropical cyclone Cost(Millions)
1,AK,0,0.0
2,AL,24,26457.6
3,AR,5,706.4
4,AZ,0,0.0
5,CA,0,0.0

In [40]:
df_wildfire= df3.groupby(by= 'state',as_index= False)['wildfire'].sum()

In [41]:
cost_per_wildfire = df2.loc[:,['state','wildfire']]

In [42]:
wildfire_cost_per_state= pd.merge(df_wildfire, cost_per_wildfire, left_on = 'state', right_on='state')

In [43]:
wildfire_cost_per_state.rename(columns={'wildfire_x': 'Total number of wildfires', 'wildfire_y': 'State wildfire Cost Millions'}, inplace= True)
wildfire_cost_per_state.index = wildfire_cost_per_state.index + 1

wildfire_cost_per_state.head()

  state  Total number of wildfires  State wildfire Cost Millions
1    AK                          8                        2292.8
2    AL                          2                         716.4
3    AR                          0                           0.0
4    AZ                         14                        1327.8
5    CA                         19                       98106.3

In [44]:
df_winter_storm= df3.groupby(by= 'state',as_index= False)['winter storm'].sum()

In [45]:
cost_per_winter_storm = df2.loc[:,['state','winter storm']]

In [46]:
winter_storm_cost_per_state= pd.merge(df_winter_storm, cost_per_winter_storm, left_on = 'state', right_on='state')

In [47]:
winter_storm_cost_per_state.rename(columns={'winter storm_x': 'Total number of Winter Stormes', 'winter storm_y': 'State Winter Storm Cost(Millions)'}, inplace= True)
winter_storm_cost_per_state.index = winter_storm_cost_per_state.index + 1

winter_storm_cost_per_state.head()

  state  Total number of Winter Stormes  State Winter Storm Cost(Millions)
1    AK                               0                                0.0
2    AL                               9                             2377.1
3    AR                               8                             1135.5
4    AZ                               0                                0.0
5    CA                               0                                0.0

In [48]:
df_deaths_per_event= df1.groupby(by= 'Disaster',as_index= False)['Deaths'].sum()
df_deaths_per_event.index = df_deaths_per_event.index + 1

In [49]:
df_deaths_per_event.head()

           Disaster  Deaths
1           Drought    4522
2          Flooding     738
3            Freeze     162
4      Severe Storm    2094
5  Tropical Cyclone    6897

In [50]:
pd.to_datetime(df1['Begin Date'], format='%Y%m%d')

0     1980-04-10
1     1980-08-07
2     1980-06-01
3     1981-01-12
4     1981-05-05
         ...
371   2023-08-11
372   2023-08-29
373   2023-09-23
374   2023-04-01
375   2023-12-16
Name: Begin Date, Length: 376, dtype: datetime64[ns]

In [51]:
pd.to_datetime(df1['End Date'], format='%Y%m%d')

0     1980-04-17
1     1980-08-11
2     1980-11-30
3     1981-01-14
4     1981-05-10
         ...
371   2023-08-11
372   2023-08-31
373   2023-09-24
374   2023-09-30
375   2023-12-18
Name: End Date, Length: 376, dtype: datetime64[ns]

In [52]:
df_cost_per_event= df1.groupby(by= 'Disaster',as_index= False)['Total CPI-Adjusted Cost (Millions of Dollars)'].sum()
df_cost_per_event.index = df_cost_per_event.index + 1

In [53]:
df_cost_per_event.head()

           Disaster  Total CPI-Adjusted Cost (Millions of Dollars)
1           Drought                                       352383.7
2          Flooding                                       196399.1
3            Freeze                                        36328.5
4      Severe Storm                                       454745.8
5  Tropical Cyclone                                      1379161.2

In [54]:
df_year_WSto= df3.groupby(by= 'year',as_index= False)['winter storm'].sum()
df_year_WSto.index = df_year_WSto.index + 1

In [55]:
df_year_WSto.head()

   year  winter storm
1  1980             0
2  1981             0
3  1982            35
4  1983             0
5  1984             0

In [56]:
df_year_Flo= df3.groupby(by= 'year',as_index= False)['flooding'].sum()
df_year_Flo.index = df_year_Flo.index + 1

In [57]:
df_year_Flo.head()

   year  flooding
1  1980         3
2  1981         0
3  1982         0
4  1983        13
5  1984         0

In [58]:
df_year_Dro= df3.groupby(by= 'year',as_index= False)['drought'].sum()
df_year_Dro.index = df_year_Dro.index + 1

In [59]:
df_year_Dro.head()

   year  drought
1  1980       21
2  1981        0
3  1982        0
4  1983       11
5  1984        0

In [60]:
df_year_Fre= df3.groupby(by= 'year',as_index= False)['freeze'].sum()
df_year_Fre.index = df_year_Fre.index + 1

In [61]:
df_year_SeSto= df3.groupby(by= 'year',as_index= False)['severe storm'].sum()
df_year_SeSto.index = df_year_SeSto.index + 1

In [62]:
df_year_TropCy= df3.groupby(by= 'year',as_index= False)['tropical cyclone'].sum()
df_year_TropCy.index = df_year_TropCy.index + 1

In [63]:
df_year_WFire= df3.groupby(by= 'year',as_index= False)['wildfire'].sum()
df_year_WFire.index = df_year_WFire.index + 1

In [64]:
df_year_WFire.head()

   year  wildfire
1  1980         0
2  1981         0
3  1982         0
4  1983         0
5  1984         0

In [65]:
Total_disasters_by_Year= df3.groupby(by= 'year',as_index= False)['flooding', 'drought', 'freeze', 'severe storm', 'tropical cyclone', 'wildfire', 'winter storm'].sum()
Total_disasters_by_Year.index = Total_disasters_by_Year.index + 1

C:\Users\esteg\anaconda3\envs\PythonData\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  """Entry point for launching an IPython kernel.

In [66]:
Total_disasters_by_Year.head()

,year,flooding,drought,freeze,severe storm,tropical cyclone,wildfire,winter storm
1,1980,3,21,0,0,2,0,0
2,1981,0,0,1,5,0,0,0
3,1982,0,0,0,33,0,0,35
4,1983,13,11,41,0,1,0,0
5,1984,0,0,0,17,0,0,0

In [67]:
df1['Begin Date']= pd.to_datetime(df1['Begin Date'], format='%Y%m%d')
df1['End Date']= pd.to_datetime(df1['End Date'], format='%Y%m%d')

In [68]:
df_deaths_per_year= df1.groupby(by= ['Begin Date', 'End Date', 'Name'],as_index= False)['Deaths'].sum()
df_deaths_per_year.index = df_deaths_per_year.index + 1

df_deaths_per_year.head()

,Begin Date,End Date,Name,Deaths
1,1980-04-10,1980-04-17,Southern Severe Storms and Flooding (April 1980),7
2,1980-06-01,1980-11-30,Central/Eastern Drought/Heat Wave (Summer-Fall...,1260
3,1980-08-07,1980-08-11,Hurricane Allen (August 1980),13
4,1981-01-12,1981-01-14,Florida Freeze (January 1981),0
5,1981-05-05,1981-05-10,"Severe Storms, Flash Floods, Hail, Tornadoes (...",20

In [69]:
df5= pd.read_csv('US_inflation_rates.csv')
df5.rename(columns={'value': 'Inflation rate value'},inplace=True)
df5.index = df5.index + 1

In [70]:
df5.head()

         date  Inflation rate value
1  1947-01-01                 21.48
2  1947-02-01                 21.62
3  1947-03-01                 22.00
4  1947-04-01                 22.00
5  1947-05-01                 21.95